Documents/УДАЛИТЬ_Замер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УДАЛИТЬ_Замер</Name>
			<Comment>Замеры</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Замеры</xr:Item>
				<xr:Item>AccumulationRegister.КонверсияВходящихКонтактов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияЗамера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_ИсходящийКонтакт</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_ВходящийКонтакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеРезультата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоясненияРезультатаЗамера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКлиента</Name>
					<Comment>Имя клиента, от которого произошло обращение</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМонтажаНеОпределена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотовыйТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Архивирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАрхивации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАрхивацииПрикрепленныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьАрхивации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАрхивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайлаGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиGD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидФайлаПрограммыПостроителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыФайловПрограммыПостроителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаДоставку</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаключениеЗаказаДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗаключениеЗаказаДоговора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОформленЗаказДоговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Замер</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СМСОтправленные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СМСОтправленные</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтправкаСМС</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСМС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СМСКОтправке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СМСКОтправке</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтправкаСМС</v8:Type>
						<v8:Type>cfg:DocumentRef.УДАЛИТЬ_Замер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПризнакСМС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиСМС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СрокиМонтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СрокиМонтажа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатаМонтажаНеОпределена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажНаОдинДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонтажНаНесколькоДней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПризнакиСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПризнакиСМС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измененная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УДАЛИТЬ_Замер/Forms/ФормаДокумента/Ext/Form/Module.bsl
//ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ БЕЗ КОНТЕКСТА
&НаСервереБезКонтекста
Функция Десериализовать(XMLОбъект)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLОбъект);
	ПолученныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	Возврат ПолученныйОбъект;
	
КонецФункции

&НаСервереБезКонтекста
Функция Сериализовать(ОбъектСериализации)
	
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	ЗаписьXMLДанных = Новый ЗаписьXML;
	ЗаписьXMLДанных.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXMLДанных,ДеревоВОбъектеXDTO);
	Возврат ЗаписьXMLДанных.Закрыть();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатЗаключениеДоговора()
	
	Возврат Справочники.РезультатыЗамера.ЗаключениеДоговора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатОтказНаЗамере()
	
	Возврат Справочники.РезультатыЗамера.ОтказНаЗамере;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРезультатОтказПоЗвонку()
	
	Возврат Справочники.РезультатыЗамера.ОтказПоЗвонку;
	
КонецФункции

&НаСервереБезКонтекста
Функция СохранитьПрикрепленныеДанные(Ссылка, ИмяФайла, Расширение, Данные)
	Результат = Истина;
	Попытка
		
		МенеджерЗаписи = РегистрыСведений.ПрикрепленныеДанные.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.Данные = Новый ХранилищеЗначения(Десериализовать(Данные));
		МенеджерЗаписи.ИмяФайла = ИмяФайла;
		МенеджерЗаписи.Расширение = Расширение;
		МенеджерЗаписи.СсылкаНаОбъект = Ссылка;
		МенеджерЗаписи.Записать(Ложь);
		
	Исключение
		Результат = Ложь;
		Сообщить(" " + ОписаниеОшибки());
	КонецПопытки;
	Возврат Результат;
КонецФункции

//ПРОЦЕДУРЫ И ФУНКЦИИ НА СЕРВЕРЕ
&НаСервере
Функция МоджноЗаписатьДокумент()
	Отказ = Ложь;
	
	Если НЕ Объект.Результат = ПолучитьРезультатОтказПоЗвонку() Тогда
		Если Объект.ВремяНачалаЗамера < Константы.НачалоРабочегоВремениЗамеров.Получить() Тогда
			Сообщить("Время начала замера должно быть не менее " + Формат(Константы.НачалоРабочегоВремениЗамеров.Получить(),"ДЛФ=В") + ". Возможное время начала и завершения замеров указывается в настройках",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если Объект.ВремяНачалаЗамера >= Константы.КонецРабочегоВремениЗамеров.Получить() Тогда
			Сообщить("Время начала замера должно быть не более " + Формат(Константы.КонецРабочегоВремениЗамеров.Получить(),"ДЛФ=В") + ". Возможное время начала и завершения замеров указывается в настройках",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
			
	Если Отказ Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьОсновнойТелефонКонтрагента(Контрагент)
	Возврат "";
КонецФункции

&НаСервере
Функция ПолучитьКонтактыОснования(Основание)
	Если НЕ Основание = Неопределено Тогда
		КонтактыОснования = "ФИО: " + Основание.ИмяКлиента + ". Телефон: " + Основание.СотовыйТелефонКлиента;
		Возврат КонтактыОснования;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект);
		Элементы.ОтказПоЗвонку.Видимость = Ложь;
		Объект.ДатаЗамера = ТекущаяДатаСеанса();
		Объект.ОтветственныйМенеджер = Объект.Ответственный.Сотрудник;
	Иначе
		Элементы.ОтказПоЗвонку.Видимость = Истина;
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;

	Если НЕ Параметры.Основание = Неопределено Тогда
		Если НЕ Параметры.Основание.Пустая() Тогда
			Объект.Основание = Параметры.Основание;
			Объект.ИмяКлиента = Параметры.Основание.ИмяКлиента;
			Объект.СотовыйТелефонКлиента = Параметры.Основание.СотовыйТелефонКлиента;
		КонецЕсли;
	КонецЕсли;
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
КонецПроцедуры

&НаСервере
Функция СформироватьГрафик()
	Возврат МодульОтчетов.СформироватьГрафикЗамеров(Объект.ДатаЗамера, ТаблицаДанных);
КонецФункции

&НаСервере
Функция ПроверитьСвободныйИнтервалЗамеров(ДатаЗамера, Сотрудник, ВремяНачала, ВремяОкончания)
	
	Возврат ОбщийМодуль.ПроверитьСвободныйИнтервалЗамеров(ДатаЗамера, Сотрудник, ВремяНачала, ВремяОкончания);
	
КонецФункции

&НаСервере
Функция ЗапланироватьЗамер(ИмяЯчейки)
	
	ВремяНачалаЗамеров = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяКонцаЗамеров = Константы.КонецРабочегоВремениЗамеров.Получить();
	КоличествоИНтервалов30минут = (Число(Формат(ВремяКонцаЗамеров,"ДФ=ЧЧ")) - Число(Формат(ВремяНачалаЗамеров,"ДФ=ЧЧ"))) * 2;
	
	//надо разобрать имя вида R99C99 на индекс колонки и индекс строки ТаблицыДанных
	НачалоР = Найти(ИмяЯчейки,"R");
	НачалоС = Найти(ИмяЯчейки,"C");
	ИндексКолонки = Сред(ИмяЯчейки,НачалоС+1,СтрДлина(ИмяЯчейки)-НачалоР-НачалоС+1)-1;
	ИндексСтроки = Сред(ИмяЯчейки,2,НачалоС-НачалоР-1)-6;
	
	Если ИндексКолонки < 0 или ИндексСтроки < 0 или ИндексКолонки>(КоличествоИНтервалов30минут+1) или ИндексСтроки > (ТаблицаДанных.Количество()-1) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	ВыбранныйСотрудник = ТаблицаДанных[ИндексСтроки].Сотрудник;
	//ВыбранноеВремя = НачалоДня(Объект.ДатаЗамера);
	ВыбранноеВремя = ВремяНачалаЗамеров + (ИндексКолонки-1)*60*30;
	
	//определяем можно ли добавить замер определеной длины в выбраннй интервал
	ДлиназамераПоУмолчаниюВЧасах = Константы.КоличествоЧасовНеобходимыхНаЗамер.Получить();
	ВремяОкончанияЗамера = ВыбранноеВремя + (Дата(1,1,1,Цел(ДлиназамераПоУмолчаниюВЧасах),(ДлиназамераПоУмолчаниюВЧасах - Цел(ДлиназамераПоУмолчаниюВЧасах))*60,0)-Дата(1,1,1,0,0,0));
	ИнтервалСвободный = ПроверитьСвободныйИнтервалЗамеров(Объект.ДатаЗамера, ВыбранныйСотрудник, ВыбранноеВремя, ВремяОкончанияЗамера);
	Если НЕ ИнтервалСвободный Тогда
		Сообщить("В выбранное время замер добавить нельзя, т.к. периоды замеров пересекаются",СтатусСообщения.Важное);
		Возврат Ложь;
	Иначе
		Объект.Исполнитель = ВыбранныйСотрудник;
		Объект.ВремяНачалаЗамера = ВыбранноеВремя;
		Объект.ВремяОкончанияЗамера = ВремяОкончанияЗамера;
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокПоясненийРезультата()
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоясненияРезультатаЗамера.Ссылка
	|ИЗ
	|	Справочник.ПоясненияРезультатаЗамера КАК ПоясненияРезультатаЗамера
	|ГДЕ
	|	ПоясненияРезультатаЗамера.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Результат.Добавить(РезультатЗапроса.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//ПРОЦЕДУРЫ И ФУНКЦИИ НА КЛИЕНТЕ
&НаКлиенте
Процедура ОбновитьФорму()
	
	Элементы.ДатаМонтажа.Доступность = НЕ (Объект.СрокМонтажа = ПредопределенноеЗначение("Перечисление.СрокиМонтажа.ДатаМонтажаНеОпределена"));
	Элементы.ВремяМонтажа.Доступность = НЕ (Объект.СрокМонтажа = ПредопределенноеЗначение("Перечисление.СрокиМонтажа.ДатаМонтажаНеОпределена"));
	Элементы.ДекорацияКонтактыОснования.Заголовок = "Контакты, указанные в основании: " + ПолучитьКонтактыОснования(Объект.Основание);
	//ВывестиГрафик();
	
	Если ПраваПользователей.РазрешеноИспользованиеСофтФона() Тогда
		Элементы.ПозвонитьПоНомеру.Видимость = Истина;
	Иначе
		Элементы.ПозвонитьПоНомеру.Видимость = Ложь;
	КонецЕсли;
	
	ПолучитьПервончальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьФорму();	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиГрафик()
	График = СформироватьГрафик();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Массив = Элементы.График.ПолучитьВыделенныеОбласти();
	ЗапланироватьЗамер(Массив[0].Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыДокументаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаГрафик" Тогда
		График = СформироватьГрафик();
		ЭтаФорма.ОбновитьОтображениеДанных();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВремяОкончанияЗамера < Объект.ВремяНачалаЗамера Тогда
		Сообщить("Время окончания замера меньше времени начала. Необходимо исправить.",СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если (Секунда(Объект.ВремяОкончанияЗамера) = 0) или (Секунда(Объект.ВремяОкончанияЗамера) = 30) Тогда
		Объект.ВремяОкончанияЗамера = Объект.ВремяОкончанияЗамера - 1;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаключенДоговор(Команда)
	
	Отказ = Ложь;
	Если Объект.СуммаДокумента = 0 Тогда
		Сообщить("Не указана сумма договора!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	Если НЕ Объект.СрокМонтажа = ПредопределенноеЗначение("Перечисление.СрокиМонтажа.ДатаМонтажаНеОпределена") Тогда
		Если Объект.ДатаМонтажа = Дата("00010101") или Объект.ВремяМонтажа = Дата("00010101") Тогда
			Сообщить("Не указана планируемые дата и время монтажа!",СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если МоджноЗаписатьДокумент() Тогда
		Попытка
			Объект.Результат = ПолучитьРезультатЗаключениеДоговора();
			Объект.ПояснениеРезультата = "";
			
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
			ЭтаФорма.Записать(ПараметрыЗаписи);
			
			ЭтаФорма.Закрыть(Объект.Ссылка);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаОтказНаЗамере(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Попытка
		Объект.Результат = ПолучитьРезультатОтказНаЗамере();
		Объект.ПояснениеРезультата = ВыбранныйЭлемент.Значение;
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ЭтаФорма.Записать(ПараметрыЗаписи);
		
		ЭтаФорма.Закрыть(Объект.Ссылка);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ВыборРезультатаОтказПоЗвонку(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	Попытка
		Объект.Результат = ПолучитьРезультатОтказПоЗвонку();
		Объект.ПояснениеРезультата = ВыбранныйЭлемент.Значение;
		//зачищаем данные, чтобы освободить график
		Объект.Исполнитель = "";
		Объект.ДатаЗамера = "";
		Объект.ВремяНачалаЗамера = "";
		Объект.ВремяОкончанияЗамера = "";
		
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ЭтаФорма.Записать(ПараметрыЗаписи);
		
		ЭтаФорма.Закрыть(Объект.Ссылка);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ОтказНаЗамере(Команда)
	
	Если МоджноЗаписатьДокумент() Тогда
		СписокВариантов = ПолучитьСписокПоясненийРезультата();
		
		Если СписокВариантов.Количество() = 0 Тогда
			ПоказатьПредупреждение(,"В настройках программы не заданы причины отказов на замере");
			Возврат;
		КонецЕсли;
			
		
		Оп = Новый ОписаниеОповещения("ВыборРезультатаОтказНаЗамере", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.ОтказНаЗамере);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтказПоЗвонку(Команда)
	
	Если МоджноЗаписатьДокумент() Тогда
		СписокВариантов = ПолучитьСписокПоясненийРезультата();
		
		Оп = Новый ОписаниеОповещения("ВыборРезультатаОтказПоЗвонку", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокВариантов, Элементы.ОтказПоЗвонку);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗамераПриИзменении(Элемент)
	//ВывестиГрафик();
	ПолучитьПервончальныеДанныеДляГрафикаЗамеров();
	ОбновитьГрафикЗамеровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайл(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			ВыбФайл = Новый Файл(ИмяФайла);
			Если СохранитьПрикрепленныеДанные(Объект.Ссылка,ВыбФайл.ИмяБезРасширения,ВыбФайл.Расширение,Сериализовать(Новый ДвоичныеДанные(ИмяФайла))) Тогда
				Сообщить("Файлы успешно прикреплены");
			Иначе
				Сообщить("Не удалось прикрепить файлы!",СтатусСообщения.Важное);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ЕстьОформленныйЗаказДоговор()
	
	Результат = Ложь;
	
	ЕстьЗаказДоговор = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаключениеЗаказаДоговора.ОформленЗаказДоговор
	|ИЗ
	|	РегистрСведений.ЗаключениеЗаказаДоговора КАК ЗаключениеЗаказаДоговора
	|ГДЕ
	|	ЗаключениеЗаказаДоговора.Замер = &Замер";
	Запрос.УстановитьПараметр("Замер",Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ОформленЗаказДоговор Тогда
			ЕстьЗаказДоговор = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьЗаказДоговор тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОформитьЗаказДоговор(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		ПоказатьПредупреждение(,"Не указана сумма договора!",,"Отказ");
		Возврат;
	КонецЕсли;
	
	Если НЕ Объект.Результат = ПредопределенноеЗначение("Справочник.РезультатыЗамера.ЗаключениеДоговора") Тогда
		ПоказатьПредупреждение(,"Замер предварительно должен быть переведен в статус ""Заключение договора""",,"Отказ");
		Возврат;
	КонецЕсли;
	
	Если ЕстьОформленныйЗаказДоговор() Тогда
		ПоказатьПредупреждение(,"По данному замеру уже оформлен заказ-договор",,"Отказ");
		Возврат;
	КонецЕсли;
	
	Если МоджноЗаписатьДокумент() Тогда
		Попытка
			Объект.Результат = ПолучитьРезультатЗаключениеДоговора();
			Объект.ПояснениеРезультата = "";
			
			ПараметрыЗаписи = Новый Структура;
			ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
			ЭтаФорма.Записать(ПараметрыЗаписи);
			
			ПараметрыНовогоДокумента = Новый Структура;
			ПараметрыНовогоДокумента.Вставить("ЗаполнениеНаОсновании", Истина);
			ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
			ПараметрыНовогоДокумента.Вставить("Адрес", Объект.Адрес);
			ПараметрыНовогоДокумента.Вставить("Сумма", Объект.СуммаДокумента);
			ПараметрыНовогоДокумента.Вставить("Исполнитель", Объект.Исполнитель);
			ПараметрыНовогоДокумента.Вставить("ИмяКлиента", Объект.ИмяКлиента);
			
			ОткрытьФорму("Документ.ЗаказДоговор.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
			ЭтаФорма.Закрыть(Объект.Ссылка);
		Исключение
			ПоказатьПредупреждение(,ОписаниеОшибки(),,"Ошибка");
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаМонтажаНеОпределенаПриИзменении(Элемент)
	Если Объект.СрокМонтажа = ПредопределенноеЗначение("Перечисление.СрокиМонтажа.ДатаМонтажаНеОпределена") Тогда
		Объект.ДатаМонтажа = "";
		Объект.ВремяМонтажа = "";
	КонецЕсли;
	ОбновитьФорму();
КонецПроцедуры


&НаКлиенте
Процедура ОформитьМонтаж(Команда)
	
	Если Объект.СуммаДокумента = 0 Тогда
		Сообщить("Не указана сумма договора!",СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Если МоджноЗаписатьДокумент() Тогда
		Попытка
			
			ПараметрыНовогоДокумента = Новый Структура;
			ПараметрыНовогоДокумента.Вставить("ЗаполнениеНаОсновании", Истина);
			ПараметрыНовогоДокумента.Вставить("Основание", Объект.Ссылка);
			ПараметрыНовогоДокумента.Вставить("Адрес", Объект.Адрес);
			ПараметрыНовогоДокумента.Вставить("Сумма", Объект.СуммаДокумента);
			ПараметрыНовогоДокумента.Вставить("ДатаМонтажа", Объект.ДатаМонтажа);
			ПараметрыНовогоДокумента.Вставить("ВремяНачала", Объект.ВремяМонтажа);
			
			ОткрытьФорму("Документ.Монтаж.Форма.ФормаДокумента", ПараметрыНовогоДокумента);
			ЭтаФорма.Закрыть(Объект.Ссылка);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПозвонитьПоНомеру(Команда)
	СофтФонКлиент.ПозвонитьПоНомеру(Объект.СотовыйТелефонКлиента, Объект.ИмяКлиента);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры


#Область ОтправкаСМСОЗамере

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Если ИспользоватьОтправкуСМС() Тогда
			
			//СМС Клиенту
			Если ОтправлятьСМСКлиенту() Тогда 
				НомерТелефона = СокрЛП(Объект.СотовыйТелефонКлиента);		
				
				Если не ПустаяСтрока(НомерТелефона) Тогда
					//Проверяем отправлялась ли СМС клиенту
					Если СМСНеОтправлялось(Объект.ИмяКлиента) Тогда
						ТекстСМС = ПолучитьСМСКлиенту();
						ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", Объект.СотовыйТелефонКлиента);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Объект.ИмяКлиента);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Объект.Адрес);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(Объект.ВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(Объект.ДатаЗамера,"ДФ=дд ММММ"));
						ПоставитьСМСВОчередь(Объект.ИмяКлиента,НомерТелефона,ТекстСМС);
					Иначе 							
						Ответ = Вопрос("Отправить повторный СМС клиенту о замере?",РежимДиалогаВопрос.ДаНет);
						Если Ответ = КодВозвратаДиалога.Да Тогда
							ТекстСМС = ПолучитьСМСКлиенту();
							ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", Объект.СотовыйТелефонКлиента);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Объект.ИмяКлиента);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Объект.Адрес);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(Объект.ВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(Объект.ДатаЗамера,"ДФ=дд ММММ"));
							ПоставитьСМСВОчередь(Объект.ИмяКлиента,НомерТелефона,ТекстСМС);
						КонецЕсли;			
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			//СМС Замерщику
			Если ОтправлятьСМСЗамерщику() Тогда 
				НомерТелефона = СокрЛП(ПолучитьТелефонСотрудника());		
								
				Если не ПустаяСтрока(НомерТелефона) Тогда
					//Проверяем отправлялась ли СМС замерщику
					Если СМСНеОтправлялось(Объект.Ответственный) Тогда
						ТекстСМС = ПолучитьСМСЗамерщику();
						ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", Объект.СотовыйТелефонКлиента);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Объект.ИмяКлиента);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Объект.Адрес);
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(Объект.ВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
						ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(Объект.ДатаЗамера,"ДФ=дд ММММ"));
						ПоставитьСМСВОчередь(Объект.Ответственный,НомерТелефона,ТекстСМС);
					Иначе						
						Ответ = Вопрос("Отправить повторный СМС замерщику о замере?",РежимДиалогаВопрос.ДаНет);
						Если Ответ = КодВозвратаДиалога.Да Тогда
							ТекстСМС = ПолучитьСМСЗамерщику();
							ТекстСМС = СтрЗаменить(ТекстСМС, "%НомерТелефона", Объект.СотовыйТелефонКлиента);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Контрагент", Объект.ИмяКлиента);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Адрес", Объект.Адрес);
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Время", Формат(Объект.ВремяНачалаЗамера,"ДФ=ЧЧ:мм"));
							ТекстСМС = СтрЗаменить(ТекстСМС, "%Дата", Формат(Объект.ДатаЗамера,"ДФ=дд ММММ"));
							ПоставитьСМСВОчередь(Объект.Ответственный,НомерТелефона,ТекстСМС);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


&НаСервере
Функция СМСНеОтправлялось(Контрагент)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМСОтправленные.Контрагент
	               |ИЗ
	               |	РегистрСведений.СМСОтправленные КАК СМСОтправленные
	               |ГДЕ
	               |	СМСОтправленные.Контрагент = &Контрагент
	               |	И СМСОтправленные.ДокументОснование = &Основание";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции


&НаСервере
Функция ИспользоватьОтправкуСМС()	
	Возврат РаботаССМС.ИспользоватьОтправкуСМС();			
КонецФункции

&НаСервере
Функция ПолучитьТелефонСотрудника()
	//Возврат Объект.Исполнитель.УДАЛИТЬ_КонтактныйТелефон;
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект.Исполнитель, Справочники.ВидыКонтактнойИнформации.ТелефонСотрудника);
КонецФункции

&НаСервере
Функция ОтправлятьСМСКлиенту()
	Возврат Константы.ОтправлятьСМСКлиентуПриПланированииЗамера.Получить();
КонецФункции

&НаСервере
Функция ОтправлятьСМСЗамерщику()
	Возврат Константы.ОтправлятьСМСЗамерщикуПриПланированииЗамера.Получить();
КонецФункции

&НаСервере
Функция ПолучитьСМСКлиенту()
	Возврат Константы.ШаблонТекстаСМСОЗамереКлиенту.Получить();
КонецФункции

&НаСервере
Функция ПолучитьСМСЗамерщику()
	Возврат Константы.ШаблонТекстаСМСОЗамереЗамерщику.Получить();
КонецФункции

&НаСервере
Процедура ПоставитьСМСВОчередь(Контрагент,НомерТелефона,ТекстСМС);
	
	Если РаботаССМС.ИспользоватьОтправкуСМС() и Константы.АвтоматическаяРассылкаСМС.Получить() и РаботаССМС.ОтправлятьСМСКонтрагенту(Контрагент) Тогда
		МенеджерЗаписи = РегистрыСведений.СМСКОтправке.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.ДокументОснование = Объект.Ссылка;
		МенеджерЗаписи.Контрагент = Контрагент;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Период = ТекущаяДатаСеанса();
		МенеджерЗаписи.ДокументОснование = Объект.Ссылка;
		МенеджерЗаписи.Контрагент = Контрагент;
		МенеджерЗаписи.ПризнакСМС = Перечисления.ПризнакиСМС.Новая;
		МенеджерЗаписи.НомерТелефона = РаботаССМС.ПодготовитьНомерТелефонаДляОтправкиСМС(НомерТелефона);
		МенеджерЗаписи.ТекстСообщения = ТекстСМС;
		МенеджерЗаписи.Записать();
	КонецЕсли;
					
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыбратьАдрес(Команда)
	ОбработкаВыбораАдреса = Новый ОписаниеОповещения("ОбработкаВыбораАдреса", ЭтаФорма);
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("Представление",Объект.Адрес);
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.ВводАдреса",ПараметрыАдреса,ЭтаФорма,,,,ОбработкаВыбораАдреса);
КонецПроцедуры
 
 &НаКлиенте
Процедура ОбработкаВыбораАдреса(ЗначениеВыбора, Источник) Экспорт

	Если НЕ ЗначениеВыбора = Неопределено Тогда
    	Объект.Адрес = ЗначениеВыбора.Представление;
	КонецЕсли;

КонецПроцедуры



//РАБОТА С ГРАФИКОМ ЗАМЕРОВ
&НаСервере
Процедура ПолучитьПервончальныеДанныеДляГрафикаЗамеров()
	
	ТаблицаГрафикЗамеров.Очистить();
	
	ТекущийГод = Год(Объект.ДатаЗамера);
	ТекущийМесяц = Месяц(Объект.ДатаЗамера);
	ТекущееЧисло = День(Объект.ДатаЗамера);
	
	ТаблицаГрафикЗамеров.Очистить();
	
	ЗапросСотрудники = Новый Запрос;
	ЗапросСотрудники.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сотрудники.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.ВыполняетЗамеры
	|	И НЕ Сотрудники.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудники.Наименование";
	СписокСотрудников = ЗапросСотрудники.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Для НомерСотрудника = 0 По СписокСотрудников.Количество()-1 Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Замеры.Адрес,
		|	Замеры.ВремяНачала,
		|	Замеры.ВремяОкончания,
		|	Замеры.Регистратор
		|ИЗ
		|	РегистрСведений.Замеры КАК Замеры
		|ГДЕ
		|	Замеры.Дата = &Дата
		|	И Замеры.Сотрудник = &Сотрудник";
		Запрос.УстановитьПараметр("Дата",Объект.ДатаЗамера);
		Запрос.УстановитьПараметр("Сотрудник",СписокСотрудников[НомерСотрудника]);
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Количество() = 0 Тогда
			Пока Выборка.Следующий() Цикл
				Если НЕ Выборка.Регистратор = Объект.Ссылка Тогда
					НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
					НоваяСтрока.Сотрудник = СписокСотрудников[НомерСотрудника];
					НоваяСтрока.ВремяС = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(Выборка.ВремяНачала), Минута(Выборка.ВремяНачала), 0);
					НоваяСтрока.ВремяПо = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(Выборка.ВремяОкончания), Минута(Выборка.ВремяОкончания), 0);
					НоваяСтрока.Адрес = Выборка.Адрес;
				Иначе
					НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
					НоваяСтрока.Сотрудник = СписокСотрудников[НомерСотрудника];
				КонецЕсли;
			КонецЦикла;
		Иначе
			НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
			НоваяСтрока.Сотрудник = СписокСотрудников[НомерСотрудника];
		КонецЕсли;
	КонецЦикла;
	
	
	//добавим замер текущего документа
	Если Объект.ВремяНачалаЗамера = Дата(1,1,1) и Объект.ВремяОкончанияЗамера = Дата(1,1,1) и Объект.Исполнитель.Пустая() Тогда
	Иначе
		НоваяСтрока = ТаблицаГрафикЗамеров.Добавить();
		НоваяСтрока.Сотрудник = Объект.Исполнитель;
		НоваяСтрока.ВремяС = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(Объект.ВремяНачалаЗамера), Минута(Объект.ВремяНачалаЗамера), 0);
		НоваяСтрока.ВремяПо = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(Объект.ВремяОкончанияЗамера), Минута(Объект.ВремяОкончанияЗамера), 0);
		НоваяСтрока.Адрес = Объект.Адрес;
		НоваяСтрока.Новый = Истина;
	КонецЕсли;
	
	ТаблицаГрафикЗамеров.Сортировать("Сотрудник Возр");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьГрафикЗамеровНаСервере()
	
	ТекущийГод = Год(Объект.ДатаЗамера);
	ТекущийМесяц = Месяц(Объект.ДатаЗамера);
	ТекущееЧисло = День(Объект.ДатаЗамера);
	
	Для Каждого ТекущаяШкалаВремени Из ГрафикЗамеров.ШкалаВремени.Элементы Цикл
		КратностьГрафика = Константы.РазмерИнтервалаВГрафикеЗамеров.Получить();
		Если КратностьГрафика = 0 Тогда
			КратностьГрафика = 30;
		КонецЕсли;
		ТекущаяШкалаВремени.Кратность = КратностьГрафика;
	КонецЦикла;
	
	
	ГрафикЗамеров.ТекущиеПериодыОтображения.Очистить();
	
	//рисуем шкалу времени
	ВремяНачалаЗамеров = Константы.НачалоРабочегоВремениЗамеров.Получить();
	ВремяКонцаЗамеров = Константы.КонецРабочегоВремениЗамеров.Получить();
	НачальнаяДатаПланировщика = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(ВремяНачалаЗамеров), Минута(ВремяНачалаЗамеров), 0);
	КонечнаяДатаПланировщика = Дата(ТекущийГод, ТекущийМесяц, ТекущееЧисло, Час(ВремяКонцаЗамеров), Минута(ВремяКонцаЗамеров), 0);
	
	ГрафикЗамеров.ТекущиеПериодыОтображения.Добавить(НачальнаяДатаПланировщика, КонечнаяДатаПланировщика);
	
	//добавляем замерщиков
	ГрафикЗамеров.Измерения.Очистить();
	Сотрудники = ГрафикЗамеров.Измерения.Добавить("Сотрудник");
	
	ТаблицаСотрудников = ТаблицаГрафикЗамеров.Выгрузить();
	ТаблицаСотрудников.Свернуть("Сотрудник");
	Для Каждого Выборка Из ТаблицаСотрудников Цикл
		НовыйСотрудник = Сотрудники.Элементы.Добавить(Выборка.Сотрудник);
    	НовыйСотрудник.Текст = Выборка.Сотрудник.Наименование;
	КонецЦикла;
	
	//отмечаем запланированные замеры
	ЭлементыГрафика = ГрафикЗамеров.Элементы;
    ЭлементыГрафика.Очистить();
	
	Для Каждого ТекущийЗамер Из ТаблицаГрафикЗамеров Цикл   
		
		// Связка записей с измерениями выполняется через соответствия
        СоответствиеЗначений = Новый Соответствие;
        СоответствиеЗначений.Вставить("Сотрудник",   ТекущийЗамер.Сотрудник);

        // Добавление новой записи в промежуток времени
        НовыйЭлемент = ЭлементыГрафика.Добавить(ТекущийЗамер.ВремяС, ТекущийЗамер.ВремяПо);
        НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
        НовыйЭлемент.Текст              = ТекущийЗамер.Адрес;
		Если НЕ ТекущийЗамер.Новый Тогда
			НовыйЭлемент.ЦветФона			= WebЦвета.Серый;
		Иначе
			НовыйЭлемент.ЦветФона			= WebЦвета.Зеленый;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НачалоРабочегоВремениЗамеров()
	Возврат Константы.НачалоРабочегоВремениЗамеров.Получить();
КонецФункции

&НаСервере
Функция КонецРабочегоВремениЗамеров()
	Возврат Константы.КонецРабочегоВремениЗамеров.Получить();
КонецФункции

&НаСервере
Функция КоличествоЧасовНеобходимыхНаЗамер()
	Возврат Константы.КоличествоЧасовНеобходимыхНаЗамер.Получить();
КонецФункции
	

&НаКлиенте
Процедура ГрафикЗамераПередСозданием(Элемент, Начало, Конец, Значения, Текст, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НачалоРабочегоВремениЗамеров = НачалоРабочегоВремениЗамеров();
	КонецРабочегоВремениЗамеров = КонецРабочегоВремениЗамеров();
	Если Начало < Дата(Год(Объект.ДатаЗамера), Месяц(Объект.ДатаЗамера), День(Объект.ДатаЗамера), Час(НачалоРабочегоВремениЗамеров), Минута(НачалоРабочегоВремениЗамеров),0) 
		или Конец > Дата(Год(Объект.ДатаЗамера), Месяц(Объект.ДатаЗамера), День(Объект.ДатаЗамера), Час(КонецРабочегоВремениЗамеров), Минута(КонецРабочегоВремениЗамеров) ,0) Тогда
		Возврат;
	КонецЕсли;
	
	ДлинаМинимальногоЗамераВСекундах = КоличествоЧасовНеобходимыхНаЗамер()*60*60;
	Если Начало + ДлинаМинимальногоЗамераВСекундах > Конец Тогда
		Конец = Начало + ДлинаМинимальногоЗамераВСекундах;
	КонецЕсли;
	Конец = Конец - 1;
	
	//проверяем пересечения периодов
	Отказ = Ложь;
	Для Каждого СуществующаяЗапись Из ТаблицаГрафикЗамеров Цикл
		Если СуществующаяЗапись.Сотрудник = Значения.Получить("Сотрудник") Тогда
			Если НЕ СуществующаяЗапись.Новый Тогда
				Если Начало < СуществующаяЗапись.ВремяС и Конец > СуществующаяЗапись.ВремяС Тогда
					Отказ = Истина;
					Возврат;
				ИначеЕсли Начало > СуществующаяЗапись.ВремяС и Конец < СуществующаяЗапись.ВремяПо Тогда
					Отказ = Истина;
					Возврат;
				ИначеЕсли Начало < СуществующаяЗапись.ВремяПо и Конец > СуществующаяЗапись.ВремяПо Тогда
					Отказ = Истина;
					Возврат;
				ИначеЕсли Начало < СуществующаяЗапись.ВремяС и Конец > СуществующаяЗапись.ВремяПо Тогда
					Отказ = Истина;
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Отказ Тогда
		//ПоказатьПредупреждение(,"Время замера не должно пересекаться с другими заплнированными замерами");
	Иначе
		ДобавитьНовыйЗамер(Значения.Получить("Сотрудник"), Начало, Конец);
		ОбновитьГрафикЗамеровНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьНовыйЗамер(Сотрудник, ВремяС, ВремяПо)
	
	КонецМинута = Минута(ВремяПо);
	КонецЧас = Час(ВремяПо);
	КонецСекунда = Секунда(ВремяПо);
	
	Объект.Исполнитель = Сотрудник;
	Объект.ВремяНачалаЗамера = Дата(1,1,1,Час(ВремяС), Минута(ВремяС), Секунда(ВремяС));
	Объект.ВремяОкончанияЗамера = Дата(1,1,1,КонецЧас, КонецМинута, КонецСекунда);
	
	ПолучитьПервончальныеДанныеДляГрафикаЗамеров();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамераПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
	Если НЕ НовыйЭлемент Тогда
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамераПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	Если НЕ НовыйЭлемент Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамераПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикЗамераПередНачаломБыстрогоРедактирования(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Возврат;
КонецПроцедуры
